{
    "name": "SteeringPositionValue",
    "prop": [],
    "from": {
        "QualitativeValue": [
            {
                "name": "greater",
                "desc": "This ordering relation for qualitative values indicates that the subject is greater than the object.",
                "type": [
                    "QualitativeValue"
                ]
            },
            {
                "name": "equal",
                "desc": "This ordering relation for qualitative values indicates that the subject is equal to the object.",
                "type": [
                    "QualitativeValue"
                ]
            },
            {
                "name": "additionalProperty",
                "desc": "A property-value pair representing an additional characteristics of the entitity, e.g. a product feature or another characteristic for which there is no matching property in schema.org.</p>\n\n<p>Note: Publishers should be aware that applications designed to use specific schema.org properties (e.g. http://schema.org/width, http://schema.org/color, http://schema.org/gtin13, ...) will typically expect such data to be provided using those properties, rather than using the generic property/value mechanism.",
                "type": [
                    "PropertyValue"
                ]
            },
            {
                "name": "lesser",
                "desc": "This ordering relation for qualitative values indicates that the subject is lesser than the object.",
                "type": [
                    "QualitativeValue"
                ]
            },
            {
                "name": "valueReference",
                "desc": "A pointer to a secondary value that provides additional information on the original value, e.g. a reference temperature.",
                "type": [
                    "Enumeration",
                    "PropertyValue",
                    "StructuredValue",
                    "QuantitativeValue",
                    "QualitativeValue"
                ]
            },
            {
                "name": "nonEqual",
                "desc": "This ordering relation for qualitative values indicates that the subject is not equal to the object.",
                "type": [
                    "QualitativeValue"
                ]
            },
            {
                "name": "lesserOrEqual",
                "desc": "This ordering relation for qualitative values indicates that the subject is lesser than or equal to the object.",
                "type": [
                    "QualitativeValue"
                ]
            },
            {
                "name": "greaterOrEqual",
                "desc": "This ordering relation for qualitative values indicates that the subject is greater than or equal to the object.",
                "type": [
                    "QualitativeValue"
                ]
            }
        ]
    }
}