{
    "name": "UnitPriceSpecification",
    "prop": [
        {
            "name": "unitCode",
            "desc": "The unit of measurement given using the UN/CEFACT Common Code (3 characters) or a URL. Other codes than the UN/CEFACT Common Code may be used with a prefix followed by a colon.",
            "type": [
                "URL",
                "Text"
            ]
        },
        {
            "name": "billingIncrement",
            "desc": "This property specifies the minimal quantity and rounding increment that will be the basis for the billing. The unit of measurement is specified by the unitCode property.",
            "type": [
                "Number"
            ]
        },
        {
            "name": "referenceQuantity",
            "desc": "The reference quantity for which a certain price applies, e.g. 1 EUR per 4 kWh of electricity. This property is a replacement for unitOfMeasurement for the advanced cases where the price does not relate to a standard unit.",
            "type": [
                "QuantitativeValue"
            ]
        },
        {
            "name": "unitText",
            "desc": "A string or text indicating the unit of measurement. Useful if you cannot provide a standard unit code for\n<a href='unitCode'>unitCode</a>.",
            "type": [
                "Text"
            ]
        },
        {
            "name": "priceType",
            "desc": "A short text or acronym indicating multiple price specifications for the same offer, e.g. SRP for the suggested retail price or INVOICE for the invoice price, mostly used in the car industry.",
            "type": [
                "Text"
            ]
        }
    ],
    "from": {
        "PriceSpecification": [
            {
                "name": "minPrice",
                "desc": "The lowest price if the price is a range.",
                "type": [
                    "Number"
                ]
            },
            {
                "name": "eligibleTransactionVolume",
                "desc": "The transaction volume, in a monetary unit, for which the offer or price specification is valid, e.g. for indicating a minimal purchasing volume, to express free shipping above a certain order volume, or to limit the acceptance of credit cards to purchases to a certain minimal amount.",
                "type": [
                    "PriceSpecification"
                ]
            },
            {
                "name": "maxPrice",
                "desc": "The highest price if the price is a range.",
                "type": [
                    "Number"
                ]
            },
            {
                "name": "priceCurrency",
                "desc": "The currency (in 3-letter ISO 4217 format) of the price or a price component, when attached to <a class=\"localLink\" href=\"http://schema.org/PriceSpecification\">PriceSpecification</a> and its subtypes.",
                "type": [
                    "Text"
                ]
            },
            {
                "name": "eligibleQuantity",
                "desc": "The interval and unit of measurement of ordering quantities for which the offer or price specification is valid. This allows e.g. specifying that a certain freight charge is valid only for a certain quantity.",
                "type": [
                    "QuantitativeValue"
                ]
            },
            {
                "name": "validFrom",
                "desc": "The date when the item becomes valid.",
                "type": [
                    "DateTime"
                ]
            },
            {
                "name": "validThrough",
                "desc": "The date after when the item is not valid. For example the end of an offer, salary period, or a period of opening hours.",
                "type": [
                    "DateTime"
                ]
            },
            {
                "name": "price",
                "desc": "<p>The offer price of a product, or of a price component when attached to PriceSpecification and its subtypes.</p>\n\n<p>Usage guidelines:</p>\n\n<ul>\n<li>Use the <a class=\"localLink\" href=\"http://schema.org/priceCurrency\">priceCurrency</a> property (with <a href=\"http://en.wikipedia.org/wiki/ISO_4217#Active_codes\">ISO 4217 codes</a> e.g. \"USD\") instead of\n  including <a href=\"http://en.wikipedia.org/wiki/Dollar_sign#Currencies_that_use_the_dollar_or_peso_sign\">ambiguous symbols</a> such as '$' in the value.</li>\n<li>Use '.' (Unicode 'FULL STOP' (U+002E)) rather than ',' to indicate a decimal point. Avoid using these symbols as a readability separator.</li>\n<li>Note that both <a href=\"http://www.w3.org/TR/xhtml-rdfa-primer/#using-the-content-attribute\">RDFa</a> and Microdata syntax allow the use of a \"content=\" attribute for publishing simple machine-readable values alongside more human-friendly formatting.</li>\n<li>Use values from 0123456789 (Unicode 'DIGIT ZERO' (U+0030) to 'DIGIT NINE' (U+0039)) rather than superficially similiar Unicode symbols.</li>\n</ul>\n",
                "type": [
                    "Text",
                    "Number"
                ]
            },
            {
                "name": "valueAddedTaxIncluded",
                "desc": "Specifies whether the applicable value-added tax (VAT) is included in the price specification or not.",
                "type": [
                    "Boolean"
                ]
            }
        ]
    }
}